reports/kunlun_p800/benchmark/MiniMax-M2.5-W8A8-INT8-Dynamic/test_01/16-320-i10240-o256/bench-16-320-i10240-o256.log
/root/miniconda/envs/python310_torch25_cuda/lib/python3.10/site-packages/xpytorch_import_hook.py:6: UserWarning: pkg_resources is deprecated as an API. See https://setuptools.pypa.io/en/latest/pkg_resources.html. The pkg_resources package is slated for removal as early as 2025-11-30. Refrain from using this package or pin to Setuptools<81.
  import pkg_resources
XCCL /root/miniconda/envs/python310_torch25_cuda/lib/python3.10/site-packages/torch_xmlir/libbkcl.so loaded
SYMBOL_REWRITE torch success
INFO 03-24 14:23:12 [__init__.py:36] Available plugins for group vllm.platform_plugins:
INFO 03-24 14:23:12 [__init__.py:38] - kunlun -> vllm_kunlun:register
INFO 03-24 14:23:12 [__init__.py:41] All plugins in this group will be loaded. Set `VLLM_PLUGINS` to control which plugins to load.
INFO 03-24 14:23:12 [__init__.py:36] Available plugins for group vllm.platform_plugins:
INFO 03-24 14:23:12 [__init__.py:38] - kunlun -> vllm_kunlun:register
INFO 03-24 14:23:12 [__init__.py:41] All plugins in this group will be loaded. Set `VLLM_PLUGINS` to control which plugins to load.
INFO 03-24 14:23:12 [__init__.py:220] No platform detected, vLLM is running on UnspecifiedPlatform
INFO 03-24 14:23:15 [__init__.py:207] Platform plugin kunlun is activated
WARNING 03-24 14:23:16 [_custom_ops.py:20] Failed to import from vllm._C with ImportError('libcudart.so.12: cannot open shared object file: No such file or directory')
[Monkey Patch Applied] >>> from vllm.model_executor.layers.fused_moe.layer.UnquantizedFusedMoEMethod       --> vllm_kunlun.ops.fused_moe.layer.KunlunUnquantizedFusedMoEMethod
[Monkey Patch Applied] >>> from vllm.model_executor.layers.fused_moe.layer.FusedMoE       --> vllm_kunlun.ops.fused_moe.layer.KunlunFusedMoE
[Monkey Patch Applied] >>> vllm.model_executor.layers.quantization.awq.AWQLinearMethod       --> vllm_kunlun.ops.quantization.awq.KunlunAWQLinearMethod
[Monkey Patch Applied] >>> vllm.model_executor.layers.quantization.awq.AWQConfig       --> vllm_kunlun.ops.quantization.awq.KunlunAWQConfig
[Monkey Patch Applied] >>> vllm.model_executor.layers.quantization.compressed_tensors.compressed_tensors.CompressedTensorsConfig       --> vllm_kunlun.ops.quantization.compressed_tensors.KunlunCompressedTensorsConfig
[Monkey Patch Applied] >>> vllm.model_executor.layers.quantization.gptq.GPTQLinearMethod       --> vllm_kunlun.ops.quantization.gptq.KunlunGPTQLinearMethod
[Monkey Patch Applied] >>> vllm.model_executor.layers.quantization.moe_wna16.MoeWNA16Method       --> vllm_kunlun.ops.quantization.moe_wna16.KunlunMoeWNA16Method
ERROR 03-24 14:23:18 [fa_utils.py:57] Cannot use FA version 2 is not supported due to FA2 is unavaible due to: libcudart.so.12: cannot open shared object file: No such file or directory
WARNING 03-24 14:23:19 [registry.py:582] Model architecture Qwen2VLForConditionalGeneration is already registered, and will be overwritten by the new model class vllm_kunlun.models.qwen2_vl:Qwen2VLForConditionalGeneration.
WARNING 03-24 14:23:19 [registry.py:582] Model architecture Qwen2_5_VLForConditionalGeneration is already registered, and will be overwritten by the new model class vllm_kunlun.models.qwen2_5_vl:Qwen2_5_VLForConditionalGeneration.
WARNING 03-24 14:23:19 [registry.py:582] Model architecture Qwen3ForCausalLM is already registered, and will be overwritten by the new model class vllm_kunlun.models.qwen3:Qwen3ForCausalLM.
WARNING 03-24 14:23:19 [registry.py:582] Model architecture Qwen3MoeForCausalLM is already registered, and will be overwritten by the new model class vllm_kunlun.models.qwen3_moe:Qwen3MoeForCausalLM.
WARNING 03-24 14:23:19 [registry.py:582] Model architecture Qwen3NextForCausalLM is already registered, and will be overwritten by the new model class vllm_kunlun.models.qwen3_next:Qwen3NextForCausalLM.
WARNING 03-24 14:23:19 [registry.py:582] Model architecture Qwen3NextMTP is already registered, and will be overwritten by the new model class vllm_kunlun.models.qwen3_next_mtp:Qwen3NextMTP.
WARNING 03-24 14:23:19 [registry.py:582] Model architecture GlmForCausalLM is already registered, and will be overwritten by the new model class vllm_kunlun.models.glm:GlmForCausalLM.
WARNING 03-24 14:23:19 [registry.py:582] Model architecture GptOssForCausalLM is already registered, and will be overwritten by the new model class vllm_kunlun.models.gpt_oss:GptOssForCausalLM.
WARNING 03-24 14:23:19 [registry.py:582] Model architecture InternLM2ForCausalLM is already registered, and will be overwritten by the new model class vllm_kunlun.models.internlm2:InternLM2ForCausalLM.
WARNING 03-24 14:23:19 [registry.py:582] Model architecture InternVLChatModel is already registered, and will be overwritten by the new model class vllm_kunlun.models.internvl:InternVLChatModel.
WARNING 03-24 14:23:19 [registry.py:582] Model architecture InternS1ForConditionalGeneration is already registered, and will be overwritten by the new model class vllm_kunlun.models.interns1:InternS1ForConditionalGeneration.
WARNING 03-24 14:23:19 [registry.py:582] Model architecture Qwen3VLForConditionalGeneration is already registered, and will be overwritten by the new model class vllm_kunlun.models.qwen3_vl:Qwen3VLForConditionalGeneration.
WARNING 03-24 14:23:19 [registry.py:582] Model architecture Qwen3VLMoeForConditionalGeneration is already registered, and will be overwritten by the new model class vllm_kunlun.models.qwen3_vl_moe:Qwen3VLMoeForConditionalGeneration.
WARNING 03-24 14:23:19 [registry.py:582] Model architecture SeedOssForCausalLM is already registered, and will be overwritten by the new model class vllm_kunlun.models.seed_oss:SeedOssForCausalLM.
WARNING 03-24 14:23:19 [registry.py:582] Model architecture GptOssForCausalLM is already registered, and will be overwritten by the new model class vllm_kunlun.models.gpt_oss:GptOssForCausalLM.
WARNING 03-24 14:23:19 [registry.py:582] Model architecture DeepseekV3ForCausalLM is already registered, and will be overwritten by the new model class vllm_kunlun.models.deepseek_v2:DeepseekV3ForCausalLM.
WARNING 03-24 14:23:19 [registry.py:582] Model architecture DeepseekV32ForCausalLM is already registered, and will be overwritten by the new model class vllm_kunlun.models.deepseek_v2:DeepseekV3ForCausalLM.
WARNING 03-24 14:23:19 [registry.py:582] Model architecture DeepSeekMTPModel is already registered, and will be overwritten by the new model class vllm_kunlun.models.deepseek_mtp:DeepSeekMTP.
Namespace(subparser='bench', bench_type='serve', dispatch_function=<function BenchmarkServingSubcommand.cmd at 0x7f71ab365e10>, seed=123, num_prompts=320, dataset_name='random', no_stream=False, dataset_path=None, no_oversample=False, custom_output_len=256, custom_skip_chat_template=False, spec_bench_output_len=256, spec_bench_category=None, sonnet_input_len=550, sonnet_output_len=150, sonnet_prefix_len=200, sharegpt_output_len=None, blazedit_min_distance=0.0, blazedit_max_distance=1.0, random_input_len=10240, random_output_len=256, random_range_ratio=0.0, random_prefix_len=0, random_batch_size=1, random_mm_base_items_per_request=1, random_mm_num_mm_items_range_ratio=0.0, random_mm_limit_mm_per_prompt={'image': 255, 'video': 0}, random_mm_bucket_config={(256, 256, 1): 0.5, (720, 1280, 1): 0.5, (720, 1280, 16): 0.0}, hf_subset=None, hf_split=None, hf_name=None, hf_output_len=None, prefix_repetition_prefix_len=256, prefix_repetition_suffix_len=256, prefix_repetition_num_prefixes=10, prefix_repetition_output_len=128, label=None, backend='openai-chat', endpoint_type=None, base_url='http://127.0.0.1:8092', host='127.0.0.1', port=8000, endpoint='/v1/chat/completions', header=None, max_concurrency=16, model='/data/MiniMax-M2.5-W8A8-INT8-Dynamic', tokenizer=None, use_beam_search=False, logprobs=None, request_rate=inf, burstiness=1.0, trust_remote_code=True, disable_tqdm=False, profile=False, save_result=False, save_detailed=False, append_result=False, metadata=None, result_dir=None, result_filename=None, ignore_eos=False, percentile_metrics='ttft,tpot,itl', metric_percentiles='95,99', goodput=None, request_id_prefix='benchmark-serving', top_p=None, top_k=None, min_p=None, temperature=0.7, tokenizer_mode='auto', served_model_name='MiniMax2.5', lora_modules=None, ramp_up_strategy=None, ramp_up_start_rps=None, ramp_up_end_rps=None, ready_check_timeout_sec=30)
INFO 03-24 14:23:19 [datasets.py:507] Sampling input_len from [10240, 10240] and output_len from [256, 256]
Starting initial single prompt test run...
Waiting for endpoint to become up in 30 seconds

 |          | 00:00 elapsed, ? remaining
 |          | 00:00 elapsed, 00:00 remaining
 |          | 00:05 elapsed, 48:21:15 remaining
Initial test run completed. Starting main benchmark run...
Traffic request rate: inf
Burstiness factor: 1.0 (Poisson process)
Maximum request concurrency: 16

  0%|          | 0/320 [00:00<?, ?it/s]
  0%|          | 1/320 [00:15<1:23:36, 15.73s/it]
  1%|          | 2/320 [00:16<37:10,  7.02s/it]  
  1%|          | 3/320 [00:18<24:56,  4.72s/it]
  1%|▏         | 4/320 [00:19<16:53,  3.21s/it]
  2%|▏         | 5/320 [00:20<13:02,  2.48s/it]
  2%|▎         | 8/320 [00:20<05:13,  1.00s/it]
  5%|▌         | 16/320 [00:21<01:50,  2.76it/s]
  5%|▌         | 17/320 [00:34<08:53,  1.76s/it]
  6%|▌         | 18/320 [00:35<08:14,  1.64s/it]
  6%|▌         | 19/320 [00:37<08:28,  1.69s/it]
  7%|▋         | 21/320 [00:38<06:57,  1.40s/it]
  7%|▋         | 22/320 [00:40<06:49,  1.37s/it]
  9%|▉         | 29/320 [00:40<02:25,  2.00it/s]
 10%|█         | 33/320 [00:51<06:07,  1.28s/it]
 11%|█         | 34/320 [00:53<06:43,  1.41s/it]
 11%|█         | 35/320 [00:54<06:19,  1.33s/it]
 11%|█▏        | 36/320 [00:56<06:48,  1.44s/it]
 12%|█▏        | 37/320 [00:57<06:17,  1.33s/it]
 12%|█▏        | 39/320 [00:59<05:22,  1.15s/it]
 12%|█▎        | 40/320 [00:59<05:02,  1.08s/it]
 13%|█▎        | 41/320 [01:00<04:44,  1.02s/it]
 14%|█▍        | 44/320 [01:00<02:29,  1.85it/s]
 15%|█▌        | 49/320 [01:10<05:37,  1.24s/it]
 16%|█▌        | 50/320 [01:11<05:44,  1.28s/it]
 16%|█▌        | 51/320 [01:13<05:55,  1.32s/it]
 16%|█▋        | 52/320 [01:15<06:38,  1.49s/it]
 17%|█▋        | 53/320 [01:16<06:05,  1.37s/it]
 17%|█▋        | 55/320 [01:17<05:04,  1.15s/it]
 18%|█▊        | 56/320 [01:17<04:05,  1.08it/s]
 18%|█▊        | 57/320 [01:19<04:30,  1.03s/it]
 18%|█▊        | 58/320 [01:20<04:15,  1.03it/s]
 19%|█▉        | 61/320 [01:20<02:07,  2.03it/s]
 20%|██        | 65/320 [01:27<04:50,  1.14s/it]
 21%|██        | 66/320 [01:29<05:24,  1.28s/it]
 21%|██        | 67/320 [01:30<05:31,  1.31s/it]
 22%|██▏       | 69/320 [01:33<05:07,  1.23s/it]
 22%|██▏       | 70/320 [01:34<04:58,  1.19s/it]
 22%|██▏       | 71/320 [01:34<04:37,  1.11s/it]
 22%|██▎       | 72/320 [01:36<04:53,  1.18s/it]
 23%|██▎       | 73/320 [01:37<04:27,  1.08s/it]
 23%|██▎       | 75/320 [01:38<03:52,  1.05it/s]
 24%|██▍       | 76/320 [01:39<03:49,  1.06it/s]
 24%|██▍       | 77/320 [01:40<03:58,  1.02it/s]
 25%|██▌       | 80/320 [01:40<01:58,  2.02it/s]
 25%|██▌       | 81/320 [01:46<05:43,  1.44s/it]
 26%|██▌       | 82/320 [01:46<04:32,  1.14s/it]
 26%|██▌       | 83/320 [01:48<05:53,  1.49s/it]
 26%|██▋       | 84/320 [01:49<05:34,  1.42s/it]
 27%|██▋       | 85/320 [01:50<05:01,  1.28s/it]
 27%|██▋       | 86/320 [01:52<05:10,  1.33s/it]
 27%|██▋       | 87/320 [01:53<04:51,  1.25s/it]
 28%|██▊       | 88/320 [01:54<04:21,  1.13s/it]
 28%|██▊       | 89/320 [01:55<04:13,  1.10s/it]
 28%|██▊       | 90/320 [01:56<04:07,  1.08s/it]
 28%|██▊       | 91/320 [01:57<03:46,  1.01it/s]
 29%|██▉       | 92/320 [01:58<04:00,  1.05s/it]
 29%|██▉       | 93/320 [01:59<04:04,  1.08s/it]
 30%|███       | 97/320 [02:04<04:38,  1.25s/it]
 31%|███       | 99/320 [02:06<04:02,  1.10s/it]
 31%|███▏      | 100/320 [02:07<04:13,  1.15s/it]
 32%|███▏      | 101/320 [02:08<04:05,  1.12s/it]
 32%|███▏      | 102/320 [02:09<04:09,  1.14s/it]
 32%|███▏      | 103/320 [02:10<03:54,  1.08s/it]
 32%|███▎      | 104/320 [02:12<04:21,  1.21s/it]
 33%|███▎      | 105/320 [02:13<04:17,  1.20s/it]
 33%|███▎      | 106/320 [02:14<04:04,  1.14s/it]
 33%|███▎      | 107/320 [02:15<04:09,  1.17s/it]
 34%|███▍      | 108/320 [02:16<04:07,  1.17s/it]
 34%|███▍      | 109/320 [02:18<04:08,  1.18s/it]
 35%|███▌      | 113/320 [02:23<04:23,  1.27s/it]
 36%|███▌      | 115/320 [02:24<03:46,  1.11s/it]
 36%|███▋      | 116/320 [02:25<03:34,  1.05s/it]
 37%|███▋      | 117/320 [02:26<03:41,  1.09s/it]
 37%|███▋      | 118/320 [02:27<03:34,  1.06s/it]
 37%|███▋      | 119/320 [02:29<03:57,  1.18s/it]
 38%|███▊      | 120/320 [02:30<03:49,  1.15s/it]
 38%|███▊      | 121/320 [02:31<03:45,  1.13s/it]
 38%|███▊      | 122/320 [02:32<03:48,  1.15s/it]
 38%|███▊      | 123/320 [02:33<03:36,  1.10s/it]
 39%|███▉      | 124/320 [02:35<04:14,  1.30s/it]
 39%|███▉      | 125/320 [02:36<03:51,  1.19s/it]
 40%|███▉      | 127/320 [02:38<03:13,  1.00s/it]
 41%|████      | 131/320 [02:43<03:45,  1.20s/it]
 41%|████▏     | 132/320 [02:44<03:38,  1.16s/it]
 42%|████▏     | 133/320 [02:45<03:41,  1.18s/it]
 42%|████▏     | 134/320 [02:46<03:29,  1.13s/it]
 42%|████▏     | 135/320 [02:48<03:48,  1.23s/it]
 42%|████▎     | 136/320 [02:49<03:37,  1.18s/it]
 43%|████▎     | 137/320 [02:50<03:24,  1.12s/it]
 43%|████▎     | 138/320 [02:51<03:27,  1.14s/it]
 43%|████▎     | 139/320 [02:52<03:08,  1.04s/it]
 44%|████▍     | 140/320 [02:53<03:02,  1.02s/it]
 44%|████▍     | 141/320 [02:54<03:42,  1.24s/it]
 44%|████▍     | 142/320 [02:55<03:26,  1.16s/it]
 45%|████▌     | 144/320 [02:57<02:55,  1.00it/s]
 46%|████▌     | 147/320 [03:01<03:21,  1.16s/it]
 46%|████▋     | 148/320 [03:02<03:21,  1.17s/it]
 47%|████▋     | 149/320 [03:03<03:15,  1.15s/it]
 47%|████▋     | 151/320 [03:04<02:24,  1.17it/s]
 48%|████▊     | 152/320 [03:06<02:55,  1.05s/it]
 48%|████▊     | 153/320 [03:07<02:49,  1.02s/it]
 48%|████▊     | 154/320 [03:08<03:12,  1.16s/it]
 48%|████▊     | 155/320 [03:09<03:03,  1.12s/it]
 49%|████▉     | 156/320 [03:11<03:14,  1.19s/it]
 49%|████▉     | 157/320 [03:12<03:02,  1.12s/it]
 49%|████▉     | 158/320 [03:13<02:53,  1.07s/it]
 50%|█████     | 160/320 [03:15<03:00,  1.13s/it]
 50%|█████     | 161/320 [03:16<02:54,  1.10s/it]
 51%|█████     | 162/320 [03:17<02:48,  1.07s/it]
 51%|█████▏    | 164/320 [03:19<02:40,  1.03s/it]
 52%|█████▏    | 165/320 [03:21<03:18,  1.28s/it]
 52%|█████▏    | 166/320 [03:21<02:31,  1.02it/s]
 52%|█████▏    | 167/320 [03:23<02:51,  1.12s/it]
 52%|█████▎    | 168/320 [03:24<02:45,  1.09s/it]
 53%|█████▎    | 169/320 [03:25<03:04,  1.22s/it]
 53%|█████▎    | 170/320 [03:26<02:49,  1.13s/it]
 53%|█████▎    | 171/320 [03:28<03:23,  1.37s/it]
 54%|█████▍    | 172/320 [03:29<03:23,  1.38s/it]
 54%|█████▍    | 173/320 [03:30<03:02,  1.24s/it]
 54%|█████▍    | 174/320 [03:31<02:50,  1.17s/it]
 55%|█████▌    | 176/320 [03:34<02:48,  1.17s/it]
 55%|█████▌    | 177/320 [03:35<02:41,  1.13s/it]
 56%|█████▌    | 178/320 [03:36<02:35,  1.09s/it]
 56%|█████▋    | 180/320 [03:38<02:25,  1.04s/it]
 57%|█████▋    | 181/320 [03:40<02:59,  1.29s/it]
 57%|█████▋    | 183/320 [03:41<02:30,  1.10s/it]
 57%|█████▊    | 184/320 [03:42<02:27,  1.08s/it]
 58%|█████▊    | 185/320 [03:44<02:40,  1.19s/it]
 58%|█████▊    | 186/320 [03:45<02:29,  1.11s/it]
 58%|█████▊    | 187/320 [03:47<02:59,  1.35s/it]
 59%|█████▉    | 188/320 [03:48<02:58,  1.36s/it]
 59%|█████▉    | 190/320 [03:50<02:22,  1.10s/it]
 60%|█████▉    | 191/320 [03:51<02:16,  1.06s/it]
 60%|██████    | 193/320 [03:53<02:20,  1.11s/it]
 61%|██████    | 194/320 [03:54<02:13,  1.06s/it]
 61%|██████    | 195/320 [03:54<01:43,  1.21it/s]
 61%|██████▏   | 196/320 [03:56<02:07,  1.03s/it]
 62%|██████▏   | 198/320 [03:59<02:41,  1.32s/it]
 62%|██████▏   | 199/320 [04:00<02:30,  1.25s/it]
 62%|██████▎   | 200/320 [04:01<02:23,  1.19s/it]
 63%|██████▎   | 201/320 [04:03<02:34,  1.30s/it]
 63%|██████▎   | 202/320 [04:03<02:18,  1.18s/it]
 63%|██████▎   | 203/320 [04:06<02:45,  1.42s/it]
 64%|██████▍   | 204/320 [04:07<02:42,  1.40s/it]
 64%|██████▍   | 206/320 [04:08<02:07,  1.12s/it]
 65%|██████▍   | 207/320 [04:09<02:01,  1.08s/it]
 65%|██████▌   | 209/320 [04:11<01:58,  1.07s/it]
 66%|██████▌   | 210/320 [04:12<01:52,  1.02s/it]
 66%|██████▌   | 211/320 [04:13<01:48,  1.00it/s]
 66%|██████▋   | 212/320 [04:14<01:49,  1.01s/it]
 67%|██████▋   | 214/320 [04:17<02:13,  1.26s/it]
 67%|██████▋   | 215/320 [04:18<02:03,  1.17s/it]
 68%|██████▊   | 216/320 [04:19<01:57,  1.13s/it]
 68%|██████▊   | 217/320 [04:20<01:53,  1.10s/it]
 68%|██████▊   | 218/320 [04:22<02:12,  1.30s/it]
 68%|██████▊   | 219/320 [04:24<02:32,  1.51s/it]
 69%|██████▉   | 220/320 [04:26<02:27,  1.47s/it]
 69%|██████▉   | 222/320 [04:27<01:53,  1.16s/it]
 70%|██████▉   | 223/320 [04:28<01:46,  1.09s/it]
 70%|███████   | 225/320 [04:30<01:42,  1.08s/it]
 71%|███████   | 226/320 [04:31<01:36,  1.03s/it]
 71%|███████   | 227/320 [04:32<01:30,  1.03it/s]
 71%|███████▏  | 228/320 [04:33<01:24,  1.09it/s]
 72%|███████▏  | 229/320 [04:34<01:27,  1.04it/s]
 72%|███████▏  | 230/320 [04:35<01:40,  1.12s/it]
 72%|███████▏  | 231/320 [04:37<01:59,  1.34s/it]
 72%|███████▎  | 232/320 [04:38<01:49,  1.25s/it]
 73%|███████▎  | 233/320 [04:39<01:42,  1.17s/it]
 73%|███████▎  | 235/320 [04:42<01:41,  1.19s/it]
 74%|███████▍  | 236/320 [04:44<01:57,  1.40s/it]
 74%|███████▍  | 237/320 [04:45<01:54,  1.38s/it]
 75%|███████▌  | 240/320 [04:47<01:27,  1.09s/it]
 75%|███████▌  | 241/320 [04:49<01:27,  1.10s/it]
 76%|███████▌  | 242/320 [04:50<01:22,  1.06s/it]
 76%|███████▌  | 243/320 [04:50<01:17,  1.01s/it]
 76%|███████▋  | 244/320 [04:51<01:12,  1.05it/s]
 77%|███████▋  | 245/320 [04:52<01:08,  1.10it/s]
 77%|███████▋  | 246/320 [04:54<01:28,  1.20s/it]
 77%|███████▋  | 247/320 [04:56<01:42,  1.40s/it]
 78%|███████▊  | 248/320 [04:57<01:30,  1.25s/it]
 78%|███████▊  | 249/320 [04:57<01:05,  1.09it/s]
 78%|███████▊  | 250/320 [04:58<01:19,  1.14s/it]
 78%|███████▊  | 251/320 [05:00<01:25,  1.24s/it]
 79%|███████▉  | 252/320 [05:02<01:46,  1.57s/it]
 79%|███████▉  | 253/320 [05:04<01:39,  1.48s/it]
 80%|███████▉  | 255/320 [05:04<00:53,  1.21it/s]
 80%|████████  | 257/320 [05:07<01:15,  1.21s/it]
 81%|████████  | 259/320 [05:09<01:03,  1.05s/it]
 81%|████████▏ | 260/320 [05:10<01:00,  1.01s/it]
 82%|████████▏ | 261/320 [05:10<00:56,  1.05it/s]
 82%|████████▏ | 262/320 [05:13<01:12,  1.26s/it]
 82%|████████▏ | 263/320 [05:14<01:21,  1.42s/it]
 82%|████████▎ | 264/320 [05:15<01:11,  1.28s/it]
 83%|████████▎ | 266/320 [05:17<00:59,  1.11s/it]
 83%|████████▎ | 267/320 [05:19<01:03,  1.21s/it]
 84%|████████▍ | 268/320 [05:21<01:12,  1.40s/it]
 84%|████████▍ | 269/320 [05:22<01:05,  1.28s/it]
 84%|████████▍ | 270/320 [05:23<01:04,  1.29s/it]
 86%|████████▌ | 274/320 [05:27<00:48,  1.06s/it]
 86%|████████▋ | 276/320 [05:28<00:43,  1.00it/s]
 87%|████████▋ | 277/320 [05:29<00:41,  1.03it/s]
 87%|████████▋ | 278/320 [05:31<00:50,  1.20s/it]
 87%|████████▋ | 279/320 [05:33<00:55,  1.36s/it]
 88%|████████▊ | 280/320 [05:34<00:49,  1.24s/it]
 88%|████████▊ | 282/320 [05:36<00:41,  1.10s/it]
 88%|████████▊ | 283/320 [05:37<00:44,  1.20s/it]
 89%|████████▉ | 284/320 [05:39<00:49,  1.37s/it]
 89%|████████▉ | 285/320 [05:40<00:44,  1.26s/it]
 89%|████████▉ | 286/320 [05:42<00:43,  1.29s/it]
 91%|█████████ | 290/320 [05:45<00:30,  1.03s/it]
 91%|█████████ | 291/320 [05:46<00:28,  1.01it/s]
 92%|█████████▏| 293/320 [05:48<00:26,  1.02it/s]
 92%|█████████▏| 294/320 [05:50<00:31,  1.21s/it]
 92%|█████████▏| 295/320 [05:50<00:24,  1.03it/s]
 92%|█████████▎| 296/320 [05:52<00:28,  1.20s/it]
 93%|█████████▎| 297/320 [05:53<00:26,  1.17s/it]
 93%|█████████▎| 298/320 [05:54<00:27,  1.23s/it]
 93%|█████████▎| 299/320 [05:56<00:27,  1.33s/it]
 94%|█████████▍| 300/320 [05:58<00:29,  1.49s/it]
 94%|█████████▍| 301/320 [05:59<00:25,  1.34s/it]
 94%|█████████▍| 302/320 [06:00<00:23,  1.31s/it]
 95%|█████████▍| 303/320 [06:01<00:19,  1.17s/it]
 96%|█████████▌| 306/320 [06:01<00:07,  1.87it/s]
 96%|█████████▌| 307/320 [06:03<00:10,  1.29it/s]
 96%|█████████▋| 308/320 [06:03<00:08,  1.41it/s]
 97%|█████████▋| 309/320 [06:03<00:06,  1.74it/s]
 97%|█████████▋| 311/320 [06:05<00:06,  1.29it/s]
 98%|█████████▊| 312/320 [06:06<00:05,  1.45it/s]
 98%|█████████▊| 313/320 [06:06<00:04,  1.65it/s]
 98%|█████████▊| 314/320 [06:07<00:03,  1.80it/s]
 98%|█████████▊| 315/320 [06:08<00:04,  1.24it/s]
 99%|█████████▉| 316/320 [06:09<00:03,  1.14it/s]
 99%|█████████▉| 317/320 [06:09<00:02,  1.42it/s]
 99%|█████████▉| 318/320 [06:10<00:01,  1.63it/s]
100%|█████████▉| 319/320 [06:10<00:00,  2.11it/s]
100%|██████████| 320/320 [06:10<00:00,  1.16s/it]
tip: install termplotlib and gnuplot to plot the metrics
============ Serving Benchmark Result ============
Successful requests:                     320       
Maximum request concurrency:             16        
Benchmark duration (s):                  370.49    
Total input tokens:                      3276748   
Total generated tokens:                  78678     
Request throughput (req/s):              0.86      
Output token throughput (tok/s):         212.36    
Peak output token throughput (tok/s):    480.00    
Peak concurrent requests:                27.00     
Total Token throughput (tok/s):          9056.73   
---------------Time to First Token----------------
Mean TTFT (ms):                          1614.11   
Median TTFT (ms):                        782.77    
P95 TTFT (ms):                           6500.38   
P99 TTFT (ms):                           8846.69   
-----Time per Output Token (excl. 1st token)------
Mean TPOT (ms):                          68.31     
Median TPOT (ms):                        70.43     
P95 TPOT (ms):                           77.37     
P99 TPOT (ms):                           81.82     
---------------Inter-token Latency----------------
Mean ITL (ms):                           68.08     
Median ITL (ms):                         34.74     
P95 ITL (ms):                            70.16     
P99 ITL (ms):                            647.93    
==================================================